firstAnswer = document.querySelector('.first-text')
secondAnswer = document.querySelector('.second-text')
thirdAnswer = document.querySelector('.third-text')
fourthAnswer = document.querySelector('.fourth-text')
question = document.querySelector('.question')

const questions = [
    'Какой вид компьютеров предназначен для решения различных задач типы которых не оговариваются:',
    'Какой вид компьютеров служит для решения более узкого круга задач, связанных, как правило, с управлением технологическими объектами, регистрацией, накоплением и обработкой небольших объемов данных, выполнением расчетов по несложным правилам:',
    'Какой вид компьютеров позволяет специализировать структуру задач и снизить стоимость и сложность при сохранении высокой производительности и надежности:',
    'Для решения различных задач кроме ЭВМ требуется так же и...',
    'Супер ЭВМ это-',
    'Для чего требуется многопроцессорные компьютеры?',
    'Какие по назначению могут быть МикроЭВМ?',
    'Какие по числу пользователей могут быть МикроЭВМ?',
    'По конструктировным особенностям Пк делятся на…',
    'Типовая конфигурация Пк включает в себя',
    ]
const answers = []



for (element of questions) {
    question.innerHTML = element
}