const firstAnswer = document.querySelector('.first-text');
const secondAnswer = document.querySelector('.second-text');
const thirdAnswer = document.querySelector('.third-text');
const answersButton = document.querySelector('.list');
const questionText = document.querySelector('.question');
const blockResult = document.querySelector('.result')
const textResult = document.querySelector('.result-text')
const blockHeader = document.querySelector('.main__header')
const username = document.querySelector('.profile__name');

const actualPage = Number(localStorage.getItem('actualPage'))
username.innerHTML = localStorage.getItem('username')
const allQuestions = {
    firstPage: [
    'Какой вид компьютеров предназначен для решения различных задач типы которых не оговариваются:',
    'Какой вид компьютеров служит для решения более узкого круга задач, связанных, как правило, с управлением технологическими объектами, регистрацией, накоплением и обработкой небольших объемов данных, выполнением расчетов по несложным правилам:',
    'Какой вид компьютеров позволяет специализировать структуру задач и снизить стоимость и сложность при сохранении высокой производительности и надежности:',
    'Для решения различных задач кроме ЭВМ требуется так же и...',
    'Супер ЭВМ это-',
    'Для чего требуется многопроцессорные компьютеры?',
    'Какие по назначению могут быть МикроЭВМ?',
    'Какие по числу пользователей могут быть МикроЭВМ?',
    'По конструктировным особенностям Пк делятся на…',
    'Типовая конфигурация Пк включает в себя',
    ],
    secondPage: [
        'Самый распространенный тип компьютеров',
        'Компьютер у которого все комплектующие находятся в дисплее монитора',
        'Разновидность переносных или мобильных ПК',
        'Компьютер, заточенный для узкого круга определенных задач, к примеру таких как работа с графикой, звуком, видео или вычисление специфических примеров, в основном используется профессионалами своей области',
        'Своего рода системный блок, плоский, больше и тяжелей, за счет большей начинки. Начинка может быть разная, но постоянно увеличивается производительность',
        'Сверхмощные системы представляющие множество компьютеров работающих как одно целое',
        'Универсальный большой компьютер общего назначения',
        'Главные недостатки супер компьютеров',
        'Главные недостатки ноутбуков',
        'Главные недостатки моноблоков?',
    ],
    thirdPage: [
        'Устройство, преобразующее графический образ, хранящийся как содержимое памяти компьютера, в форму, пригодную для дальнейшего вывода на экран монитора',
        'Компьютер, являющийся сервером компьютерной сети. Включает в себя: минимальная конфигурация',
        'Набор средств для отвода тепла от нагревающихся в процессе работы компьютерных компонентов',
        'Дополнительное оборудование персонального компьютера и ноутбука, позволяющее обрабатывать звук',
        'Комплект расположенных в определённом порядке клавиш для управления каким-либо устройством или для ввода данных',
        'Устройство, применяющееся в системах связи для физического сопряжения информационного сигнала со средой его распространения, где он не может существовать без адаптации',
        'Акустическая система, состоящая из большого количества одинаковых громкоговорителей, расположенных вертикально',
        'Устройство оперативной визуальной связи пользователя с управляющим устройством и отображением данных, передаваемых с клавиатуры, мыши или центрального процессора',
        'Запоминающее устройство произвольного доступа, основанное на принципе магнитной записи',
        'координатное устройство для управления курсором и отдачи различных команд компьютеру',
    ],
    fourthPage: [
        'Совокупность программных и документальных средств',
        'Программы предназначенные для решения задач в различных сферах деятельности человека',
        'К какому ПО относятся программы управляющие работой компьютера?',
        'К какому ПО относятся среды программирования для создания новых программ',
        'Системный комплекс взаимосвязанных программ',
        'Комплексы программ создающих для пользователя удобный интерфейс',
        'Программы обеспечивающие взаимодействие прикладных программ',
        'Программы вспомогательного назначения обеспечивающие дополнительный сервис',
        'Программы позволяющие создавать архивы для извлечения не требующие вспомогательного ПО',
        'Программы предназначены для предоствращения заражения компьютера',
    ],
}

const allAnswers = {
    firstPage: [
        'Универсальный', 'Проблемно ориентированные', 'Специализированный',
        'Универсальный','Проблемно-ориентированные', 'Специализированный',
        'Универсальный', 'Проблемно ориентированные', 'Специализированный',
        'Вычислительная техника', 'Ничего', 'Программист',
        'Мощные многопроцессорные компьютеры с огромным быстродействием', 'Слабые компьютеры', 'Ноутбуки',
        'Для решения экспериментальных задач', 'Для игр', 'Для фотошопа',
        'Многопользовательскими', 'Проблемно-ориентированные', 'Универсальными и специализированными',
        'Однодоступные и двухдоступные.', 'Однодоступные и Многопользовательские', 'Многопользовательские и Однопользовательские',
        'Не переносные и переносные','Стационарные и переносные','Игровые и не игровые',
        'Клавиатура дисплей','Колонки наушники', 'Системный блок,дисплей,клавиатуру'
    ],
    secondPage: [
        'Стационарный', 'Моноблок', 'Ноутбук',
        'Стационарный', 'Моноблок', 'Ноутбук',
        'Стационарный', 'Моноблок', 'Ноутбук',
        'Моноблок', 'Стационарный', 'Рабочая станция',
        'Сервер(хост)', 'Рабочая станция', 'Моноблок',
        'Системный блок', 'Суперкомпьютер', 'Стационарный',
        'Мейнфрейм', 'Суперкомпьютер', 'Ноутбук',
        'Требует большого пространства и происходит большой расход энергии', 'Их нет', 'Достаточно слабые',
        'Перегрев и больших усилий для замены компектующих', 'Дорогие', 'Тяжелые',
        'Дорогой системный блок', 'Занимает много места', 'Цена и мощность'
    ],
    thirdPage: [
        'Колонки', 'Монитор', 'Видеокарта',
        'Сервер', 'Звуковая плата', 'Системный блок',
        'Система охлаждения', 'Клавиатура', 'Модем',
        'Клавиатура', 'Модем', 'Звуковая плата',
        'Клавиатура', 'Монитор', 'Звуковая плата',
        'Колонки', 'Модем', 'Монитор',
        'Модем', 'Клавиатура', 'Колонки',
        'Клавиатура', 'Монитор', 'Видеокарта',
        'Мышь', 'Жесткий диск', 'Монитор',
        'Модем', 'Видеокарта', 'Мышь',

    ],
    fourthPage: [
        'Программное обеспечение', 'Прикладное обеспечение', 'Инструментальное обеспечение',
        'Системному', 'Прикладному', 'Инструментальному',
        'Инструментальному', 'Обычному', 'Системному',
        'Инструментальному', 'Системному', 'Прикладному',
        'Системные оболочки', 'Операционная система', 'Программные оболочки',
        'Утилиты', 'Драйвера', 'Диалоговые оболочки',
        'Драйверы', 'Утилиты', 'Диалоговые оболочки',
        'Умилиты', 'Утилиты', 'Диалоговые оболочки',
        'Драйверы', 'Архиваторы', 'Архивайзеры',
        'Антивирусные программы', 'Противовирусники', 'Касперские',
    ],
}

const allTrueAnswers = {
    firstPage: [1, 2, 3, 1, 1, 1, 3, 3, 2, 3],
    secondPage: [1, 2, 3, 3, 1, 2, 1, 1, 1, 3],
    thirdPage: [3, 1, 1, 3, 1, 2, 3, 2, 2, 3],
    fourthPage: [1, 2, 3, 1, 2, 3, 1, 2, 2, 1],
}

let questions = [];
let answers = [];
let trueAnswers = [];
let userAnswers = []; 
let numberQuestion = 0;

if (actualPage === 0) {
    questions = allQuestions.firstPage;
    answers = allAnswers.firstPage;
    trueAnswers = allTrueAnswers.firstPage
}  else if (actualPage === 1) {
    questions = allQuestions.secondPage;
    answers = allAnswers.secondPage;
    trueAnswers = allTrueAnswers.secondPage
}   else if (actualPage === 2) {
    questions = allQuestions.thirdPage;
    answers = allAnswers.thirdPage;
    trueAnswers = allTrueAnswers.thirdPage
}   else if (actualPage === 3) {
    questions = allQuestions.fourthPage;
    answers = allAnswers.fourthPage;
    trueAnswers = allTrueAnswers.fourthPage
}


const render = () => {
    questionText.innerHTML = questions[numberQuestion];
    firstAnswer.innerHTML = answers[numberQuestion * 3];
    secondAnswer.innerHTML = answers[numberQuestion * 3 + 1];
    thirdAnswer.innerHTML = answers[numberQuestion * 3 + 2];
};

const moveToNextQuestion = (e) => {
    const userAnswer = e.target.id;
    if (userAnswer) {
        if (numberQuestion < 9) {
        userAnswers.push(userAnswer);
        numberQuestion++;
        render()
        }  else {
            let counterTrueAnswer = 0;
            for (let i = 0; i < 10; i++) {
                if (trueAnswers[i] === Number(userAnswers[i])) {
                    counterTrueAnswer++;
                }
            }
            questionText.style.display = 'none'
            answersButton.style.display = 'none'
            blockHeader.style.display = 'none'
            blockResult.style.display = 'flex'
            textResult.innerHTML = `Вы ответили правильно на ${counterTrueAnswer} вопросов, поздравляем!`
        }
    }
};
render()
answersButton.addEventListener('click', moveToNextQuestion)